from tkinter import *
from tkinter import ttk

"""
Меню
"""

"""
Для создания иерархического меню в tkinter применяется виджет Menu. Основные
параметры Menu:
"""
# activebackground: цвет активного пункта меню
# activeborderwidth: толщина границы активного пункта меню
# activeforeground: цвет текста активного пункта меню
# background / bg: фоновый цвет
# bd: толщина границы
# cursor: курсор указателя мыши при наведении на меню
# disabledforeground: цвет, когда меню находится в состоянии DISABLED
# font: шрифт текста
# tearoff: меню может быть отсоединено от графического окна. В частности, при
# создании подменю в скриншоте можно увидеть прерывающуюся линию в
# верху подменю, за которую его можно отсоединить. Однако при значении
# tearoff=0 подменю не сможет быть отсоединено
"""
Меню может
"""